; domain
(define (domain emergency-logistics)
    (:requirements :strips :typing)
    (:types
        drone person box arm content location
    )
    (:predicates
        (at-drone ?d - drone ?l - location)
        (at-person ?p - person ?l - location)
        (at-box ?b - box ?l - location)
        (box-contains ?b - box ?c - content)
        (free ?d - drone ?a - arm)
        (holding ?d - drone ?a - arm ?b - box)
        (needs ?p - person ?c - content)
        (has ?p - person ?c - content)
    )
    (:action fly
        :parameters (?d - drone ?from - location ?to - location)
        :precondition (at-drone ?d ?from)
        :effect (and (not (at-drone ?d ?from)) (at-drone ?d ?to))
    )
    (:action pick-up
        :parameters (?d - drone ?a - arm ?b - box ?l - location)
        :precondition (and (at-drone ?d ?l) (at-box ?b ?l) (free ?d ?a))
        :effect (and (holding ?d ?a ?b) (not (free ?d ?a)) (not (at-box ?b ?l)))
    )
    (:action deliver
        :parameters (?d - drone ?a - arm ?b - box ?p - person ?l - location ?c - content)
        :precondition (and (holding ?d ?a ?b) (at-drone ?d ?l) (at-person ?p ?l) (box-contains ?b ?c) (needs ?p ?c))
        :effect (and (has ?p ?c) (not (holding ?d ?a ?b)) (free ?d ?a))
    )
)

; problem
(define (problem esl-problem2)
    (:domain emergency-logistics)
    (:objects
        d1 - drone
        p1 p2 - person
        b1 b2 b3 - box
        left right - arm
        food medicine - content
        depot loc1 loc2 - location
    )
    (:init
        (at-drone d1 depot)
        (at-box b1 depot)
        (at-box b2 depot)
        (at-box b3 depot)
        (at-person p1 loc1)
        (at-person p2 loc2)
        (box-contains b1 food)
        (box-contains b2 medicine)
        (box-contains b3 food)
        (free d1 left)
        (free d1 right)
        (needs p1 food)
        (needs p2 medicine)
    )
    (:goal
        (and (has p1 food) (has p2 medicine))
    )
)

; plan
1. (pick-up d1 left b1 depot)
   deleted: (free d1 left) (at-box b1 depot)
   added: (holding d1 left b1)
   goals met: 0 of 2
2. (pick-up d1 right b2 depot)
   deleted: (free d1 right) (at-box b2 depot)
   added: (holding d1 right b2)
   goals met: 0 of 2
3. (fly d1 depot loc1)
   deleted: (at-drone d1 depot)
   added: (at-drone d1 loc1)
   goals met: 0 of 2
4. (deliver d1 left b1 p1 loc1 food)
   deleted: (holding d1 left b1)
   added: (has p1 food) (free d1 left)
   goals met: 1 of 2
5. (fly d1 loc1 loc2)
   deleted: (at-drone d1 loc1)
   added: (at-drone d1 loc2)
   goals met: 1 of 2
6. (deliver d1 right b2 p2 loc2 medicine)
   deleted: (holding d1 right b2)
   added: (has p2 medicine) (free d1 right)
   goals met: 2 of 2
